# RbsFamilyContentAnnotationDisplay Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFamilyContentAnnotationDisplay Property
ParameterTypeId Class See Also
---
"Use Annotation Scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFamilyContentAnnotationDisplay { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFamilyContentAnnotationDisplay As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFamilyContentAnnotationDisplay {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace